Autodesk.Revit.DB.RowHeightOverrideOptions
Describes the options for overriding schedule body row heights (applied when viewed as a ScheduleSheetInstance on a ViewSheet).
Since:
2024
Since:
2024

Autodesk.Revit.DB.RowHeightOverrideOptions.ImageRows
Override row height for body rows containing images in the schedule.

Autodesk.Revit.DB.RowHeightOverrideOptions.All
Override row height for any body rows in the schedule.

Autodesk.Revit.DB.RowHeightOverrideOptions.None
No override would be applied for the row height.